Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOptionWarn Property
 A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingSweepByElementsInDesignOptionWarn { get; }
Public Shared ReadOnly Property ConfusingSweepByElementsInDesignOptionWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingSweepByElementsInDesignOptionWarn {
	FailureDefinitionId^ get ();
}
static member ConfusingSweepByElementsInDesignOptionWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace